[Subtitles]
Orchid_VO_Prologue_0010_Live_TheKid_1=Once upon a time there was a great treasure in the desert.,
Orchid_VO_Prologue_0010_Live_TheKid_2=The treasure hunter finds it, kills all the bad guys, and that's it.
Orchid_VO_Prologue_0020_Live_Marcus=No, no, not as a story.!
Orchid_VO_Prologue_0030_Live_TheKid=love it.
Orchid_VO_Prologue_0040_Live_Marcus_1=I don't think I ate enough this week. How can I start a conversation?:
Orchid_VO_Prologue_0040_Live_Marcus_2=Rumor has it that Captain Blade lost his treasure in the sand..
Orchid_VO_Prologue_0040_Live_Marcus_3=It's a gift that people love to receive.
Orchid_VO_Prologue_0040_Live_Marcus_4=A bold and deadly ship queen, she will stop at nothing to capture him..
Orchid_VO_Prologue_0040_Live_Marcus_5=About the terrible Leviathan. Water hunters go to the desert city of Botanic,
Orchid_VO_Prologue_0040_Live_Marcus_6=He didn't know what terrible things would happen to them. do you see That's how it happened.
Orchid_VO_Prologue_0050_Live_TheKid=I have more information..
Orchid_VO_Prologue_0060_Live_Marcus=Your life's gonna be succinct, you dirty little orphan.